Revit 2027 API
ParameterTypeId.AnalyticalNodeConnectionStatus Property
 "Connection Status"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalNodeConnectionStatus { get; }
Public Shared ReadOnly Property AnalyticalNodeConnectionStatus As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalNodeConnectionStatus {
	ForgeTypeId^ get ();
}
static member AnalyticalNodeConnectionStatus : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace